InformationRegisters/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНакладной</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтгруженныеНакладные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтгруженныеНакладные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_НакладнаяНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_НакладнаяНаОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СтатусыОбъектовЗалогаВНакладной</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СтатусыНакладнойНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышеннаяОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНастроек</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановкаНастроекСозданияНакладныхНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_ПеремещениеОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПеремещениеОбъектовЗалога</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОприходованныеОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВСумке</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеремещенияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПеремещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_КатегорииПоступленияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИЗLX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Comment>Сумма оценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтказОтВыкупа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ЛБ_ВыборНакладных/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация; 
	КонецЕсли;	
	Если Параметры.Свойство("Ломбард") Тогда
		Ломбард = Параметры.Ломбард;  
		НоваяСтр = Ломбарды.Добавить();
	    НоваяСтр.Ломбард = Ломбард;
	КонецЕсли;
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ВидОперации; 
	КонецЕсли;	                           
	ЭтаФорма.Заголовок = ?(ВидОперации = 0, "Выбор накладных для отгрузки", "Выбор накладных для отмены отгрузки");  
	Если ВидОперации = 0 Тогда
		Элементы.СтрокаЛомбарды.Видимость = Ложь; 
		Элементы.Ломбард.Видимость = Истина;
	Иначе    
		Элементы.СтрокаЛомбарды.Видимость = Истина; 
		Элементы.Ломбард.Видимость = Ложь;
		ЗаполнитьСписокЛомбардов(); 
	КонецЕсли;	
	ПолучитьНакладные();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СтрокаЛомбарды = Результат; 
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокРезультат()  
	СписокРезультат.Очистить(); 
	
	Для каждого Эл из СписокНакладных Цикл 
		Если Эл.Пометка Тогда 
			СписокРезультат.Добавить(Эл.Значение);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда) 
	ЗаполнитьСписокРезультат();
	
	Если СписокРезультат.Количество() = 0 Тогда
		Предупреждение("Не выбраны накладные на отгрузку", 60);   
	Иначе
		ЭтаФорма.Закрыть(СписокРезультат);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.закрыть();
КонецПроцедуры

&НаСервере
Процедура ПолучитьНакладные()
	СписокНакладных.Очистить();
	СписокЛ = Новый СписокЗначений;
	Для каждого Стр Из Ломбарды Цикл 
		СписокЛ.Добавить(Стр.Ломбард);
	КонецЦикла;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ); 
	Запрос.УстановитьПараметр("СтатусНакладной", ?(ВидОперации = 0, Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта, Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена));	
	
	//+МАН 22.08.25 Вернул старый запрос
	////lion+++
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних
	//               |ГДЕ
	//               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной = &СтатусНакладной
	//               |	И ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку.Организация = &Организация
	//               |	И ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку.Ломбард В(&Ломбарды)
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Период УБЫВ";
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(
	               |			,
	               |			НакладнаяНаОтгрузку.Ломбард В(&Ломбарды)
	               |				И НакладнаяНаОтгрузку.Организация = &Организация) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних
	               |ГДЕ
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной = &СтатусНакладной
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Период УБЫВ";
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(,СтатусНакладной = &СтатусНакладной
	//               |	И НакладнаяНаОтгрузку.Организация = &Организация
	//               |	И НакладнаяНаОтгрузку.Ломбард В(&Ломбарды)
	//			   |) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних
	//			   |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Период УБЫВ";
	//lion---
	//-МАН
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		//+МАН 22.08.25 Вынес в отдельную функцию и повесил на установку отметки.
		//lion+++ 19.08.2025
		//БылиДвиженияПоЗБДаннойНакладнойДляОтмены=Ложь; //Если форма открыта для отмены то проверяем движения если не для отмены то Ложь и идём по старому пути
		//Если не ВидОперации = 0 тогда //Если это для Отмены, то анализируем все ЗБешки и даём отлуп если нужно
		//	ЗБпоНакладной = Новый Запрос;

		//	ЗБпоНакладной.Текст=" 
		//		|SELECT РАЗЛИЧНЫЕ
		//		|ЗалоговыйБилет
		//		|FROM Документ.ЛБ_НакладнаяНаОтгрузку.Залоги
		//		|WHERE ССЫЛКА=&НакладнаяНаОтгрузку
		//		|"; //левое соединение для отсева накладных у которых были документы выписины
		//	ЗБпоНакладной.Параметры.Вставить("НакладнаяНаОтгрузку",Выборка.НакладнаяНаОтгрузку);
		//	
		//	ВыборкаЗБпоНакладной=ЗБпоНакладной.Выполнить().Выбрать();
		//		
		//	Пока ВыборкаЗБпоНакладной.Следующий() Цикл
		//		ДвиженияПоЗБПослеНакладной = Новый Запрос;
		//		ДвиженияПоЗБПослеНакладной.Текст = 
		//			"
		//			|SELECT 
		//			|Ссылка, ЗалоговыйБилет
		//			|FROM Документ.ЛБ_Реализация.Товары
		//			|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата

		//			|ОБЪЕДИНИТЬ

		//			|SELECT 
		//			|Ссылка, ЗалоговыйБилет
		//			|FROM Документ.ЛБ_ПеремещениеОбъектовЗалога.Товары
		//			|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата

		//			|ОБЪЕДИНИТЬ

		//			|SELECT 
		//			|Ссылка, ЗалоговыйБилет
		//			|FROM Документ.ЛБ_ОприходованиеОбъектовЗалога.Товары
		//			|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата

		//			|ОБЪЕДИНИТЬ

		//			|SELECT 
		//			|Ссылка, ЗалоговыйБилет
		//			|FROM Документ.ЛБ_КорректировкаНакладной.ЗалоговыеБилеты
		//			|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата";
		//		
		//		ДвиженияПоЗБПослеНакладной.Параметры.Вставить("ЗалоговыйБилет",ВыборкаЗБпоНакладной.ЗалоговыйБилет);
		//		ДвиженияПоЗБПослеНакладной.Параметры.Вставить("ЗалоговыйБилетДата",ВыборкаЗБпоНакладной.ЗалоговыйБилет.Дата);
		//		РезультатЗапросаДвиженияПоЗБПослеНакладной = ДвиженияПоЗБПослеНакладной.Выполнить();
		//		Если не РезультатЗапросаДвиженияПоЗБПослеНакладной.Пустой() тогда
		//			БылиДвиженияПоЗБДаннойНакладнойДляОтмены=Истина;
		//			Сообщить("Внимание! По ЗБ №"+ВыборкаЗБпоНакладной.ЗалоговыйБилет.НомерЗалоговогоБилета+" из накладной №"+СокрЛП(Выборка.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной)+" есть операция после отгрузки. Отмена отгрузки накладной невозможна");
		//		КонецЕсли;
		//		
		//		//Для отладки, документы попавшие в список злодеев
		//		ВыборкаДетальныеЗаписиДвиженияПоЗБПослеНакладной = РезультатЗапросаДвиженияПоЗБПослеНакладной.Выбрать();
		//		Пока ВыборкаДетальныеЗаписиДвиженияПоЗБПослеНакладной.Следующий() Цикл
		//			Сообщить("    "+ВыборкаДетальныеЗаписиДвиженияПоЗБПослеНакладной.Ссылка+" по накладной "+СокрЛП(Выборка.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной));
		//		КонецЦикла;
		//	КонецЦикла;	

		//КонецЕсли;
		////lion--- 19.08.2025			   
		//
		//Если Не БылиДвиженияПоЗБДаннойНакладнойДляОтмены тогда //lion 19.08.2025 //или ВидОперации = 0 только для случая выбора уже учтено в условии выше
		//-МАН
			ПредставлениеНакладной = "Накладная на отгрузку № " + СокрЛП(Выборка.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной) + " " + СокрЛП(Выборка.НакладнаяНаОтгрузку.Ломбард); 
			СписокНакладных.Добавить(Выборка.НакладнаяНаОтгрузку, ПредставлениеНакладной, Ложь);
		//КонецЕсли;//lion 19.08.2025
	КонецЦикла;
КонецПроцедуры	


&НаКлиенте
Процедура СтрокаЛомбардыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", ТекущаяДата());
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СтрокаЛомбарды,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры     

&НаСервере
Процедура СохранитьЛомбарды(Результат)
	Ломбарды.Очистить();  
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	ПолучитьНакладные();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
	    Возврат;
	КонецЕсли;
		
	СохранитьЛомбарды(Результат);	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	Ломбарды.Очистить();  
	НоваяСтр = Ломбарды.Добавить();
	НоваяСтр.Ломбард = Ломбард;
	ПолучитьНакладные();
КонецПроцедуры

&НаКлиенте
Процедура СписокНакладныхПометкаПриИзменении(Элемент)
	ТекСтр = Элементы.СписокНакладных.ТекущиеДанные;
	
	Если ТекСтр <> Неопределено Тогда
		Если ВидОперации = 1 Тогда
			Если ТекСтр.Пометка Тогда
				ЕстьДвижение = ПроверитьДвижениеЗБВНакладной(ТекСтр.Значение);
				
				Если ЕстьДвижение Тогда
					НайденаяСтр = СписокНакладных.НайтиПоЗначению(ТекСтр.Значение);
					НайденаяСтр.Пометка = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьДвижениеЗБВНакладной(НакладнаяСсылка)
	
	БылиДвиженияПоЗБДаннойНакладнойДляОтмены = Ложь;
	
	ЗапросДатыОтгрузкиНакладной = Новый Запрос;
	
	ЗапросДатыОтгрузкиНакладной.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ЛБ_ОтгруженныеНакладныеСрезПоследних.Период КАК Период
	                              |ИЗ
	                              |	РегистрСведений.ЛБ_ОтгруженныеНакладные.СрезПоследних КАК ЛБ_ОтгруженныеНакладныеСрезПоследних
	                              |ГДЕ
	                              |	ЛБ_ОтгруженныеНакладныеСрезПоследних.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
	                              |
	                              |УПОРЯДОЧИТЬ ПО
	                              |	Период УБЫВ";
	
	ЗапросДатыОтгрузкиНакладной.УстановитьПараметр("НакладнаяНаОтгрузку", НакладнаяСсылка);
	
	РезультатЗапроса = ЗапросДатыОтгрузкиНакладной.Выполнить().Выгрузить();
	 
	Если РезультатЗапроса.Количество() > 0 Тогда
		ДатаОтгрузкиНакладной = РезультатЗапроса[0].Период;
	КонецЕсли;
	
	//Здесь, возможно, нужна установка другой даты если РезультатЗапроса.Количество() <= 0.
	 
	ЗБпоНакладной = Новый Запрос;
	
	ЗБпоНакладной.Текст=" 
	|SELECT РАЗЛИЧНЫЕ
	|ЗалоговыйБилет
	|FROM Документ.ЛБ_НакладнаяНаОтгрузку.Залоги
	|WHERE ССЫЛКА=&НакладнаяНаОтгрузку
	|"; //левое соединение для отсева накладных у которых были документы выписины
	ЗБпоНакладной.Параметры.Вставить("НакладнаяНаОтгрузку", НакладнаяСсылка);
	
	ВыборкаЗБпоНакладной=ЗБпоНакладной.Выполнить().Выбрать();
	
	Пока ВыборкаЗБпоНакладной.Следующий() Цикл
		ДвиженияПоЗБПослеНакладной = Новый Запрос;
		ДвиженияПоЗБПослеНакладной.Текст = 
		"
		|SELECT 
		|Ссылка, ЗалоговыйБилет
		|FROM Документ.ЛБ_Реализация.Товары
		|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата
		
		|ОБЪЕДИНИТЬ
		
		|SELECT 
		|Ссылка, ЗалоговыйБилет
		|FROM Документ.ЛБ_ПеремещениеОбъектовЗалога.Товары
		|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата
		
		|ОБЪЕДИНИТЬ
		
		|SELECT 
		|Ссылка, ЗалоговыйБилет
		|FROM Документ.ЛБ_ОприходованиеОбъектовЗалога.Товары
		|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата
		
		|ОБЪЕДИНИТЬ
		
		|SELECT 
		|Ссылка, ЗалоговыйБилет
		|FROM Документ.ЛБ_КорректировкаНакладной.ЗалоговыеБилеты
		|WHERE ЗалоговыйБилет=&ЗалоговыйБилет и ССЫЛКА.Проведен И ССЫЛКА.Дата>&ЗалоговыйБилетДата";
		
		ДвиженияПоЗБПослеНакладной.Параметры.Вставить("ЗалоговыйБилет",ВыборкаЗБпоНакладной.ЗалоговыйБилет);
		//+МАН 25.08.25
		ДвиженияПоЗБПослеНакладной.Параметры.Вставить("ЗалоговыйБилетДата",ДатаОтгрузкиНакладной);
		//ДвиженияПоЗБПослеНакладной.Параметры.Вставить("ЗалоговыйБилетДата",ВыборкаЗБпоНакладной.ЗалоговыйБилет.Дата);
		//-МАН
		
		РезультатЗапросаДвиженияПоЗБПослеНакладной = ДвиженияПоЗБПослеНакладной.Выполнить();
		Если не РезультатЗапросаДвиженияПоЗБПослеНакладной.Пустой() тогда
			БылиДвиженияПоЗБДаннойНакладнойДляОтмены = Истина;
			Сообщить("Внимание! По ЗБ №"+ВыборкаЗБпоНакладной.ЗалоговыйБилет.НомерЗалоговогоБилета+" из накладной №"+СокрЛП(НакладнаяСсылка.ПредставлениеНомераНакладной)+" есть операция после отгрузки. Отмена отгрузки накладной невозможна");
		КонецЕсли;
		
		//Для отладки, документы попавшие в список злодеев
		//ВыборкаДетальныеЗаписиДвиженияПоЗБПослеНакладной = РезультатЗапросаДвиженияПоЗБПослеНакладной.Выбрать();
		//Пока ВыборкаДетальныеЗаписиДвиженияПоЗБПослеНакладной.Следующий() Цикл
		//	Сообщить("    "+ВыборкаДетальныеЗаписиДвиженияПоЗБПослеНакладной.Ссылка+" по накладной "+СокрЛП(Выборка.НакладнаяНаОтгрузку.ПредставлениеНомераНакладной));
		//КонецЦикла;
	КонецЦикла;
	
	Возврат БылиДвиженияПоЗБДаннойНакладнойДляОтмены;
КонецФункции
